Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: Example 5. sprintf(): zero-padded integers
pt_br: Exemplo 5. sprintf(): zero-padded integers

source: Example 6. sprintf(): formatting currency
pt_br: Exemplo 6. sprintf(): formatting currency

source: Example 1. sql_regcase() Example
pt_br: Exemplo 1. sql_regcase() Example

source: Returns the square root of arg.
pt_br: Descrição

source: ?php / / Precision depends on your precision directive echo sqrt( 9); / / 3 echo sqrt(10); / / 3.16227766...?
pt_br: ?php / / Precisão depende de sua diretiva precision echo sqrt( 9); / / 3 echo sqrt(10); / / 3.16227766...?

source: See also pow().
pt_br: Veja também pow().

source: / / seed with microseconds function make_seed() {list($usec, $sec) = explode( '', microtime()); return (float) $sec + ((float) $usec * 100000);} srand(make_seed()); $randval = rand();
pt_br: / / semeira com microsegundos function make_seed() {list($usec, $sec) = explode( '', microtime()); return (float) $sec + ((float) $usec * 100000);} srand(make_seed()); $randval = rand();

source: See also rand(), getrandmax() and mt_srand().
pt_br: Veja também rand(), getrandmax() e mt_srand().

source: Values are returned by using the optional return statement.
pt_br: Valores podem ser retornados utilizando a instrução opcional return.

source: Any type may be returned, including lists and objects.
pt_br: Qualquer tipo pode ser retornado, incluindo arrays e objetos.

source: This causes the function to end its execution immediately and pass control back to the line from which it was called.
pt_br: Isto faz com que as função termine sua execução imediatamente e passa o controle de volta para a linha de onde ela foi chamada.

source: See return() for more information.
pt_br: Veja a documentação da função return() para maiores informações.

source: function square ($num) {return $num * $num;} echo square (4); / / outputs '16 '.
pt_br: function quadrado ($num) {return $num * $num;} echo quadrado (4); / / imprime '16 '.

source: You can 't return multiple values from a function, but similar results can be obtained by returning a list.
pt_br: Você não pode retornar múltiplos valores a partir de uma função, mas resultados similares podem ser devolvidos retornando por uma lista.

source: function small_numbers() {return array (0, 1, 2);} list ($zero, $one, $two) = small_numbers();
pt_br: function numeros_pequenos() {return array (0, 1, 2);} list ($zero, $um, $dois) = numeros_pequenos();

source: To return a reference from a function, you have to use the reference operator in both the function declaration and when assigning the returned value to a variable:
pt_br: Para retornar uma referência de uma função, você precisa utilizar o operador de referência tanto na declaração da função como quando assimilando o valor retornado para a variável.

source: function returns_reference() {return $someref;} $newref = returns_reference();
pt_br: function retorna_referencia() {return $alguma_referencia;} $nova_referencia = retorna_referencia();

source: For more information on references, please check out References Explained.
pt_br: Para mais detalhes sobre referências, leia a seção Referências.

source: Example 1. sscanf() Example
pt_br: Exemplo 1. sscanf() Example

source: Example 2. sscanf() - using optional parameters
pt_br: Exemplo 2. sscanf() - using optional parameters

source: Gathers the statistics of the file named by filename.
pt_br: Pegar estatísticas sobre o arquivo com o nome de nomedoarquivo.

source: number of links
pt_br: número de links

source: size in bytes
pt_br: tamanho em bytes

source: Returns FALSE in case of error.
pt_br: Retorna FALSE em caso de erro.

source: stat() cannot be used on remote files.
pt_br: stat() não pode ser utilizado em arquivos remotos.

source: Example 1. strcasecmp() example
pt_br: Exemplo 1. strcasecmp() example

source: This function is an alias for strstr(), and is identical in every way.
pt_br: Esta função é um apelido para strstr(), e é idêndica de todos os meios.

source: Returns 0 if str1 is less than str2; 0 if str1 is greater than str2, and 0 if they are equal.
pt_br: Retorna 0 se str1 é menor do que str2; 0 se str1 é maior do que str2, e 0 se forem iguais.

source: Note that this comparison is case sensitive.
pt_br: Note que esta função diferencia maiúsculas e minúsculas.

source: See also ereg(), strcasecmp(), substr(), stristr(), strncasecmp(), strncmp(), and strstr().
pt_br: Veja também ereg(), strcasecmp(), substr(), stristr(), strncasecmp(), strncmp(), e strstr().

source: Returns 0 if str1 is less than str2; 0 if str1 is greater than str2, and 0 if they are equal. strcoll() uses the current locale for doing the comparisons.
pt_br: Retorna 0 se str1 é menor do que str2; 0 se str1 é maior do que str2, e 0 se forem iguais. strcoll() usa o local atual para fazer as comparações.

source: If the current locale is C or POSIX, this function is equivalent to strcmp().
pt_br: Se o local atual for C ou POSIX, esta função é equivalente à strcmp().

source: Note that this comparison is case sensitive, and unlike strcmp() this function is not binary safe.
pt_br: Note que esta função diferencia maiúsculas e minúsculas, e diferentemente de strcmp() esta função não é segura para binário.

source: See also ereg(), strcmp(), strcasecmp(), substr(), stristr(), strncasecmp(), strncmp(), strstr(), and setlocale().
pt_br: Veja também ereg(), strcmp(), strcasecmp(), substr(), stristr(), strncasecmp(), strncmp(), strstr(), e setlocale().

source: Returns the length of the initial segment of str1 which does not contain any of the characters in str2.
pt_br: Retorna o tamanho do segmento inicial de str1 que não contém nenhum dos caracteres em str2.

source: See also strspn().
pt_br: Veja também strspn().

source: Adds filtername to the list of filters attached to stream.
pt_br: Description

source: Returns information about an existing stream.
pt_br: Description

source: See Appendix I for more information about wrappers.
pt_br: See Apêndice I for more information about wrappers.

source: See Appendix I for more information about wrappers and their wrapper data.
pt_br: See Apêndice I for more information about wrappers and their wrapper data.

source: Example 1. stream_set_timeout() Example
pt_br: Exemplo 1. stream_set_timeout() Example

source: Output using fwrite() is normally buffered at 8K.
pt_br: Description

source: Example 1. stream_set_write_buffer() example
pt_br: Exemplo 1. stream_set_write_buffer() example

source: Returns a string formatted according to the given format string using the given timestamp or the current local time if no timestamp is given.
pt_br: Descrição

source: Month and weekday names and other language dependent strings respect the current locale set with setlocale().
pt_br: Retorna uma string formatada de acordo com o formato dado em timestamp ou o horário corrente se nenhum timestamp é dado.

source: %a - abbreviated weekday name according to the current locale
pt_br: Nomes de mês e dia da semana e outras strings dependentes de linguagens respeitam o a localidade definida com setlocale().

source: %b - abbreviated month name according to the current locale
pt_br: As seguintes conversões especificadoras são conhecidas no formato de string:

source: %B - full month name according to the current locale
pt_br: %a - dia da semana abreviado de acordo com a localidade

source: %c - preferred date and time representation for the current locale
pt_br: %A - nome da semana completo de acordo com a localidade

source: %C - century number (the year divided by 100 and truncated to an integer, range 00 to 99)
pt_br: %b - nome do mês abreviado de acordo com a localidade

source: %D - same as %m / %d / %y
pt_br: %B - nome do mês completo de acordo com a localidade

source: %e - day of the month as a decimal number, a single digit is preceded by a space (range '1' to '31')
pt_br: %c - representação da data e hora preferida para a localidade

source: %G - The 4-digit year corresponding to the ISO week number (see %V).
pt_br: %C - número do século (o ano dividido por 100 e truncado para um inteiro, de 00 até 99)

source: This has the same format and value as %Y, except that if the ISO week number belongs to the previous or next year, that year is used instead.
pt_br: %d - dia do mês como um número decimal (de 01 até 31)

source: %h - same as %b
pt_br: %D - mesmo que %m / %d / %y

source: %I - hour as a decimal number using a 12-hour clock (range 01 to 12)
pt_br: %e - dia do mês como um número decimal, um simples dígito é precedido por espaço (de '1' até '31')

source: %j - day of the year as a decimal number (range 001 to 366)
pt_br: %g - como %G, mas sem o século.

source: %M - minute as a decimal number
pt_br: %G - o 4-dígito do ano correspodendo as ISO week number (see %V).

source: %p - either `am' or `pm 'according to the given time value, or the corresponding strings for the current locale
pt_br: Este tem o mesmo formato e valor que %Y, exceto que se o ISO week number pertence ao prévio ou próximo ano, aquele ano é usado ao invés deste.

source: %r - time in a.m. and p.m. notation
pt_br: %h - mesmo que %b

source: %S - second as a decimal number
pt_br: %H - hora como um número decimal usando um relógio de 24-horas (de 00 até 23)

source: %T - current time, equal to %H:%M:%S
pt_br: %I - hora como um número decimal usando um relógio de 12-hoas (de 01 até 12)

source: %u - weekday as a decimal number [1,7], with 1 representing Monday
pt_br: %j - dia do ano como número decimal (de 001 até 366)

source: Sun Solaris seems to start with Sunday as 1 although ISO 9889:1999 (the current C standard) clearly specifies that it should be Monday.
pt_br: %M - minuto como número decimal

source: %V - The ISO 8601:1988 week number of the current year as a decimal number, range 01 to 53, where week 1 is the first week that has at least 4 days in the current year, and with Monday as the first day of the week. (Use %G or %g for the year component that corresponds to the week number for the specified timestamp.)
pt_br: %n - caracter novalinha

source: %W - week number of the current year as a decimal number, starting with the first Monday as the first day of the first week
pt_br: %p - um dos dois `am' ou `pm 'de acordo com o valor da hora dada, ou as strings correspondentes para a localidade

source: %w - day of the week as a decimal, Sunday being 0
pt_br: %r - hora em a.m. e p.m. notação

source: %x - preferred date representation for the current locale without the time
pt_br: %R - hora em notação de 24 horas

source: %X - preferred time representation for the current locale without the date
pt_br: %S - segundo como um número decimal

source: %y - year as a decimal number without a century (range 00 to 99)
pt_br: %t - caracter tab

source: %Y - year as a decimal number including the century
pt_br: %T - hora corrente, igual a %H:%M:%S

source: %% - a literal `% 'character
pt_br: %u - dia da semana como número decimal [1,7], com 1 representando Segunda-feira

source: Not all conversion specifiers may be supported by your C library, in which case they will not be supported by PHP' s strftime().
pt_br: Sun Solaris parece iniciar o Domingo como 1 embora ISO 9889:1999 (o padrão C corrente) claramente especificados que ele poderia ser segunda-feira.

source: This means that e.g. %e, %T, %R and %D (there might be more) will not work on Windows.
pt_br: %U - dia da semana do ano corrente como número decimal, começando com o primeiro domingo como o primeiro dia da primeira semana

source: setlocale (LC_TIME, "C"); print (strftime ("%A in Finnish is ")); setlocale (LC_TIME, "fi_FI"); print (strftime ("%A, in French ")); setlocale (LC_TIME, "fr_FR"); print (strftime ("%A and in German ")); setlocale (LC_TIME, "de_DE"); print (strftime ("%A.\n"));
pt_br: %V - \O número da semana corrente ISO 8601:1988 do ano corrente como um número decimal, de 01 até 53, onde semana 1 é a primeira semana que tem pelo menos 4 dias no ano corrente, e com segunda-feira como o primeiro dia da semana. (Use %G ou %g para o componente anual que corresponde ao dia da semana para o para o timestamp especificado.)

source: Note: %G and %V, which are based on ISO 8601:1988 week numbers can give unexpected (albiet correct) results if the numbering system is not thoroughly understood.
pt_br: %W - dia da semana do ano corrente como número decimal, começando com o a segunda-feira como o primeiro dia da primera semana

source: ?php / * December 2002 / January 2003 ISOWk M Tu W Thu F Sa Su ---- - --------------------------- - 51 16 17 18 19 20 21 22 52 23 24 25 26 27 28 29 1 30 31 1 2 3 4 5 2 6 7 8 9 10 11 12 3 13 14 15 16 17 18 19 * / / / Outputs:
pt_br: %X - representação preferida para a hora para a localidade corrente sem a data

source: 12 / 28 / 2002 - %V,%G,%Y = 52,2002,2002 print "12 / 28 / 2002 - %V,%G,%Y =". strftime("%V,%G,%Y",strtotime("12 / 28 / 2002")). "\n"; / / Outputs:
pt_br: %Y - ano como número decimal incluindo o século

source: 12 / 30 / 2002 - %V,%G,%Y = 1,2003,2002 print "12 / 30 / 2002 - %V,%G,%Y =". strftime("%V,%G,%Y",strtotime("12 / 30 / 2002")). "\n"; / / Outputs:
pt_br: %Z - time zone ou nome or abreviação

source: 1 / 10 / 2003 - %V,%G,%Y = 2,2003,2003 print "1 / 10 / 2003 - %V,%G,%Y =". strftime("%V,%G,%Y",strtotime("1 / 10 / 2003")). "\n"; / * December 2004 / January 2005 ISOWk M Tu W Thu F Sa Su ---- - --------------------------- - 51 13 14 15 16 17 18 19 52 20 21 22 23 24 25 26 53 27 28 29 30 31 1 2 1 3 4 5 6 7 8 9 2 10 11 12 13 14 15 16 * / / / Outputs:
pt_br: Nota:

source: 12 / 31 / 2004 - %V,%G,%Y = 53,2004,2004 print "12 / 31 / 2004 - %V,%G,%Y =". strftime("%V,%G,%Y",strtotime("12 / 31 / 2004")). "\n"; / / Outputs:
pt_br: Exemplo 1. strftime() exemplo

source: See also setlocale() and mktime() and the Open Group specification of strftime().
pt_br: Veja também setlocale() e mktime() e a Open Group specification de strftime().

source: Returns a string with backslashes stripped off.
pt_br: Descrição

# Recognizes C-like , ..., octal and hexadecimal representation.
source: Recognizes C-like \n, \r..., octal and hexadecimal representation.
pt_br: Reconhece estilo C \n, \r..., representação octal e hexadecimal.

source: See also addcslashes().
pt_br: Veja também addcslashes().

source: Returns a string with backslashes stripped off. (\ 'becomes' and so on.) Double backslashes are made into a single backslash.
pt_br: Retorna uma string com as barras invertidas retiradas. (\ 'se torna' e assim por diante.) Barras invertidas duplas se tornam barras invertidas simples.

source: See also addslashes().
pt_br: Veja também addslashes().

source: This function tries to return a string with all HTML and PHP tags stripped from a given str.
pt_br: Esta função tenta retornar uma string retirando todas as tags HTML e PHP de str.

source: It errors on the side of caution in case of incomplete or bogus tags.
pt_br: Ele erra no lado de ter cuidado no caso de tags com problemas ou incompletas.

source: It uses the same tag stripping state machine as the fgetss() function.
pt_br: Usa o mesmo sistema para retirar as tags do que fgetss().

source: You can use the optional second parameter to specify tags which should not be stripped.
pt_br: Você pode utilizar o segundo parâmetro, que é opcional, para indicar tags que não devam ser retiradas.

source: Example 1. strip_tags() example
pt_br: Exemplo strip_tags()

source: This function does not modify any attributes on the tags that you allow using allowable_tags, including the style and onmouseover attributes that a mischievous user may abuse when posting text that will be shown to other users.
pt_br: Esta função não modifica nenhum dos atributos das tags que você permitiu usando allowable_tags, incluindo os atributos style e onmouseover que um usuário travesso pode abusar quando colocar texto a ser mostrado para os outros usuários.

source: Returns the length of string.
pt_br: Retorna o tamanho de string.

source: Example 1. str_pad() example
pt_br: Exemplo 1. str_pad() example

source: Example 1. strrchr() example
pt_br: Exemplo 1. strrchr() example

source: Example 1. str_repeat() example
pt_br: Exemplo 1. str_repeat() example

source: Example 1. str_replace() example
pt_br: Exemplo 1. str_replace() example

source: Returns string, reversed.
pt_br: Description

source: Reversing a string with strrev()
pt_br: Exemplo 1.

source: str_shuffle() shuffles a string.
pt_br: Description

source: ?php $str = 'abcdef'; $shuffled = str_shuffle($str); / / This will print something like: bfdaec print $shuffled;?
pt_br: Exemplo 1. str_shuffle() example

source: Example 1. strstr() example
pt_br: Exemplo 1. strstr() example

source: Example 1. strtok() example
pt_br: Exemplo 1. strtok() example

source: Example 1. strtolower() example
pt_br: Exemplo 1. strtolower() example

source: The function expects to be given a string containing an English date format and will try to parse that format into a UNIX timestamp relative to the timestamp given in now, or the current time if none is supplied.
pt_br: A função espera que seja dado uma string contendo um formato de data em inglês e tentará analisar esse formato dentro de um timestamp Unix relativo ao timestamp dado em now, ou a hora atual se nada é fornecido.

source: Upon failure, -1 is returned.
pt_br: Se fracassa, -1 é retornado.

source: Because strtotime() behaves according to GNU date syntax, have a look at the GNU manual page titled Date Input Formats.
pt_br: Porque strtotime() comporta-se de acordo com a sintaxe de data GNU, procure na página do manual GNU Date Input Formats.

source: Described there is valid syntax for the time parameter.
pt_br: Lá está descrito a sintaxe válida para o parâmetro time.

source: Example 1. strtotime() examples
pt_br: Exemplo 1. strtotime() exemplos

source: Checking for failure
pt_br: Checando por fracasso

source: The valid range of a timestamp is typically from Fri, 13 Dec 1901 20:45:54 GMT to Tue, 19 Jan 2038 03:14:07 GMT. (These are the dates that correspond to the minimum and maximum values for a 32-bit signed integer.)
pt_br: A linha de um timestamp válido é basicamente Fri, 13 Dec 1901 20:45:54 GMT to Tue, 19 Jan 2038 03:14:07 GMT. (Estes são os dados que correspondem aos valores máximos e mínimos para um inteiro de 32-bit.)

source: Example 1. strtoupper() example
pt_br: Exemplo 1. strtoupper() example

source: Example 1. strtr() example
pt_br: Exemplo 1. strtr() example

source: Returns the string value of var.
pt_br: Description

source: Counts the number of words inside string.
pt_br: Description

source: Example 1. substr_count() example
pt_br: Exemplo 1. substr_count() example

source: Example 1. substr_replace() example
pt_br: Exemplo 1. substr_replace() example

source: PHP supports the concept of variable functions.
pt_br: Funções variáveis

source: This means that if a variable name has parentheses appended to it, PHP will look for a function with the same name as whatever the variable evaluates to, and will attempt to execute it.
pt_br: O PHP suporta o conceito de funções variáveis.

source: Variable functions won' t work with language constructs such as echo(), print(), unset(), isset(), empty(), include(), require() Variable functions won't work with language constructs such as echo(), print(), unset(), isset(), empty(), include(), require() and the like.
pt_br: Entre outras coisas, isto pode ser usado para implementar callbacks, tabelas de função e assim por diante.

source: Example 13-3.
pt_br: Funções variáveis não funcionam com construtores de linguagem como echo(), unset(), isset(), empty(), include() ou print().

source: ?php function foo() {echo "In foo() br \n";} function bar($arg = '') {echo "In bar(); argument was '$arg'. br \n";} / / This is a wrapper function around echo function echoit($string) {echo $string;} $func = 'foo'; $func(); / / This calls foo() $func = 'bar'; $func('test'); / / This calls bar() $func = 'echoit'; $func('test'); / / This calls echoit()?
pt_br: Exemplo 13-1.

source: Example 13-4.
pt_br: Exemplo de funções variáveis

source: ?php class Foo {function Var() {$name = 'Bar'; $this - $name(); / / This calls the Bar() method} function Bar() {echo "This is Bar";}} $foo = new Foo(); $funcname = "Var"; $foo - $varname(); / / This calls $foo - Var()?
pt_br: Veja também:

source: See also call_user_func(), variable variables and function_exists().
pt_br: Variáveis variáveis e function_exists().

source: Classes and Objects
pt_br: Classes e Objetos

source: Example 1. swfaction() example
pt_br: Exemplo 1. swfaction() example

source: Example 2. swfaction() example
pt_br: Exemplo 2. swfaction() example

source: Example 3. swfaction() example
pt_br: Exemplo 3. swfaction() example

source: Example 4. swfaction() example
pt_br: Exemplo 4. swfaction() example

source: Example 1. swf_addbuttonrecord() function example
pt_br: Exemplo 1. swf_addbuttonrecord() function example

source: Example 2. swfbitmap() example
pt_br: Exemplo 2. swfbitmap() example

source: Example 1. swfbutton() example
pt_br: Exemplo 1. swfbutton() example

source: Example 2. swfbutton - addaction() example
pt_br: Exemplo 2. swfbutton - addaction() example

source: Example 1. swfdisplayitem - multcolor() example
pt_br: Exemplo 1. swfdisplayitem - multcolor() example

source: Example 1. swfdisplayitem - rotateto() example
pt_br: Exemplo 1. swfdisplayitem - rotateto() example

source: Example 1. swfdisplayitem - setname() example
pt_br: Exemplo 1. swfdisplayitem - setname() example

source: Example 1. swfgradient() example
pt_br: Exemplo 1. swfgradient() example

source: Example 1. swfmorph() example
pt_br: Exemplo 1. swfmorph() example

source: Example 1. swfmovie - streammp3() example
pt_br: Exemplo 1. swfmovie - streammp3() example

source: Example 1. swfshape - addfill() example
pt_br: Exemplo 1. swfshape - addfill() example

source: Example 1. swfshape() example
pt_br: Exemplo 1. swfshape() example

source: Example 1. swfshape - setline() example
pt_br: Exemplo 1. swfshape - setline() example

source: Example 1. swfsprite() example
pt_br: Exemplo 1. swfsprite() example

source: Define an object id as a symbol.
pt_br: Description

source: Miscellaneous functions
pt_br: Funções de Miscelânea

source: Example 1. swftext() example
pt_br: Exemplo 1. swftext() example

source: The number of affected rows by the last query.
pt_br: Retorna: o número de linhas afetadas pela última consulta.

source: sybase_affected_rows() returns the number of rows affected by the last INSERT, UPDATE or DELETE query on the server associated with the specified link identifier.
pt_br: sybase_affected_rows() retorna o número de linhas afetadas pelo último INSERT, UPDATE ou DELETE no servidor associado com o identificador de recurso especificado.

source: This command is not effective for SELECT statements, only on statements which modify records.
pt_br: Este comando não tem efeito em consultas SELECT; apenas em consultas que modificam registros.

source: To retrieve the number of rows returned from a SELECT, use sybase_num_rows().
pt_br: Para recuperar o número de linhas retornadas por um SELECT, utilize sybase_num_rows().

source: This function is only available using the CT library interface to Sybase, and not the DB library.
pt_br: Esta funcão está disponível apenas utilizando-se a biblioteca de interface CT para o Sybase e não disponível para a biblioteca DB.

source: Sybase functions
pt_br: Funções Sybase

source: sybase_close() closes the link to a Sybase database that's associated with the specified link identifier.
pt_br: sybase_close() fecha a conexão com um banco de dados Sybase, o qual está associado ao identificador de recurso especificado.

source: sybase_close() will not close persistent links generated by sybase_pconnect().
pt_br: sybase_close() não fechará conexões persistentes geradas pelo sybase_pconnect().
